{
  "projects": [
    {
      "name": "JollyKid",
      "image": "/jollykid.png",
      "description": "A full-stack e-commerce platform for children's clothing, built with React, Node.js, and MongoDB. It features secure authentication, Stripe payments, and responsive design — offering a smooth shopping experience with intuitive filtering, cart management, and a clean, modern UI.",
      "netlify": "https://jollykid.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-final-e-commerce"
    },
    {
      "name": "Happy thoughts",
      "image": "/happy-thoughts.png",
      "description": "A joyful, interactive social feed built with React and a custom-built API, allowing users to share positivity through happy thoughts. With real-time posting, instant likes, and an intuitive UI, it delivers a seamless, uplifting experience with smooth, responsive interactions.",
      "netlify": "https://happy-thoughts-project-technigo.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-chatbot-ek"
    },
    {
      "name": "Happy thoughts API",
      "image": "/happy-thoughts-api.png",
      "description": "A fully functional RESTful API built with Node.js, Express, and MongoDB, enabling seamless interaction with a positivity-focused social feed. It supports real-time thought posting, likes management, and efficient data handling — all optimized for smooth integration with the React frontend.",
      "netlify": "https://project-happy-thoughts-api-ek.onrender.com",
      "github": "https://github.com/EmelieNyberg/project-happy-thoughts-api-ek"
    },
    {
      "name": "Movies site",
      "image": "/movies.png",
      "description": "A dynamic film explorer built with React, React Router, and TheMovieDB API, allowing users to browse popular movies and view detailed pages with smooth, dynamic routing.",
      "netlify": "https://project-movies-emelienyberg.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-movies-vite-ek"
    },
    {
      "name": "To-do List",
      "image": "/to-do.png",
      "description": "A task management application built with TypeScript, React, and Zustand for efficient global state management. It leverages Zustand's persist middleware to save tasks in local storage, ensuring data remains intact across sessions.",
      "netlify": "https://typescript-todo-ek.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-to-dos-zustand-vite-ek/tree/typescript"
    },
    {
      "name": "Weather app",
      "image": "/weather-app.png",
      "description": "A dynamic and responsive weather experience built with vanilla JavaScript, featuring real-time data from the OpenWeatherMap API. It delivers current conditions, a four-day forecast, and sunrise/sunset times — all presented with a clean, intuitive design and seamless interaction.",
      "netlify": "https://weatherapp-ek.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-weather-app-ek"
    },
    {
      "name": "Chatbot",
      "image": "/chat-bot.png",
      "description": "The chatbot is a sleek, interactive experience built with vanilla JavaScript, offering dynamic conversations, intuitive user input, and a touch of personality — all crafted from scratch with seamless flow control and engaging effects.",
      "netlify": "https://cookiebot-lifeisbetterwithcookies.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-chatbot-ek"
    },
    {
      "name": "Melodify",
      "image": "/melodify.png",
      "description": "This project is a React app that dynamically displays albums using components, props, and .map(), featuring hover effects, a responsive design, and external links to albums and artists. The focus was on seamless UI interactions, accessibility, and precise design implementation.",
      "netlify": "https://project-music-releases-melodify.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-music-releases-vite-ek"
    },
    {
      "name": "Daily Spells",
      "image": "/spell.png",
      "description": "A collaborative mob-programming project where we transformed a Figma design for iPhone XR into a fully functional React application. The goal was to precisely follow the UX designer’s vision, implementing styled components, reusable components, and responsiveness from 320px and up.",
      "netlify": "https://dailyspell.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-design-handoff-vite"
    },
    {
      "name": "Read Cloud",
      "image": "/library.png",
      "description": "Read Cloud is a JavaScript-based interactive webpage that dynamically displays data from a provided array. The page includes filtering, sorting, and a random selection feature, allowing users to refine books based on properties like genre, rating, or most recent.",
      "netlify": "https://readcloud.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-library-EJJ"
    },
    {
      "name": "Stellar Sound",
      "image": "/stellar.png",
      "description": "A business site concept for a fictitious music streaming service, built with HTML and CSS, featuring a hero section and sign-up form. The site uses Grid, Flexbox, and Media Queries for a responsive design.",
      "netlify": "https://stellarsound.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-business-site-ek"
    },
    {
      "name": "Survey",
      "image": "/survey.png",
      "description": "A mob-programming project where we built a React survey with controlled forms, state management, and accessibility best practices. The fully responsive survey includes three questions with radio buttons, a dropdown, and a summary page displaying user responses.",
      "netlify": "https://group-project-survey.netlify.app/",
      "github": "https://github.com/EmelieNyberg/project-survey-vite"
    },
    {
      "name": "News site",
      "image": "/babies.png",
      "description": "News Site Project: A responsive news website about parenting, built with HTML, CSS, Grid, and Flexbox, ensuring adaptability across devices.",
      "netlify": "https://babies-focusedonparents.netlify.app/code/",
      "github": "https://github.com/EmelieNyberg/project-news-site-ek"
    }
  ]
}